Emacs.org
#+title: My Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ~/.emacs.d/init.el
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
* Global Variables

#+begin_src emacs-lisp

  (defconst cfg/writing-modes '(org-mode text-mode))
  (defconst cfg/default-font-size 160)
  (defconst cfg/fill-column 85)
  (defconst cfg/fill-dark-columnn 100)

#+end_src

* Package System Setup

#+begin_src emacs-lisp

  (require 'package)

  (setq package-archives '(("melpa-stable"
        . "https://stable.melpa.org/packages/")
          ("melpa" . "https://melpa.org/packages/")
          ("gnu" . "https://elpa.gnu.org/packages/")
          ("org" . "https://orgmode.org/elpa/")))

  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

   ;; Compatibility for non-Linux platforms
   ;; use-package is not installed by default
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)

   ;; Fix $PATH environment variable for X sessions of Emacs
  (use-package exec-path-from-shell)
  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize))

   ;; fixes some warnings
  (use-package gnu-elpa-keyring-update)

#+end_src

* Basic Configuration
** Disable Window Defaults

#+begin_src emacs-lisp

  (setq inhibit-startup-message t)
  ;; disable default window elements
  (menu-bar-mode -1)
(when (window-system)
    (tool-bar-mode -1)
    (blink-cursor-mode -1)
    (tooltip-mode -1)
    (scroll-bar-mode -1))

#+end_src

