Emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-30 Вт 21:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Emacs Configuration</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ru13r" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">My Emacs Configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb4ea96f">1. Global Variables</a></li>
<li><a href="#org5a4c5bc">2. Package System Setup</a></li>
<li><a href="#org0a72ff2">3. Basic Configuration</a>
<ul>
<li><a href="#org1b94cb1">3.1. Disable Window Defaults</a></li>
<li><a href="#org8daa91c">3.2. Default Settings</a></li>
<li><a href="#org53070d6">3.3. Mouse Scrolling</a></li>
<li><a href="#org2607a46">3.4. Save and Restore</a></li>
</ul>
</li>
<li><a href="#orgc4bc002">4. Global Packages</a>
<ul>
<li><a href="#orgc87876d">4.1. Which Key</a></li>
<li><a href="#orgbcf7d83">4.2. Ivy and Counsel</a></li>
<li><a href="#org0a41193">4.3. Helpful Help Commands</a></li>
<li><a href="#org48fc338">4.4. Expand Region</a></li>
<li><a href="#org1877ca9">4.5. Emojify</a></li>
</ul>
</li>
<li><a href="#org729ebeb">5. UI Configuration</a>
<ul>
<li><a href="#orgd9f0e46">5.1. Built-ins</a></li>
<li><a href="#orgefb6d2b">5.2. All The Icons</a></li>
<li><a href="#orgf8d4ff1">5.3. Font Face</a></li>
<li><a href="#orga40c5f3">5.4. Color Theme</a></li>
<li><a href="#org9e47a40">5.5. Dashboard</a></li>
<li><a href="#org5fb44d4">5.6. Centaur Tabs</a></li>
<li><a href="#orgf7a87fe">5.7. Doom Modeline</a></li>
<li><a href="#org9e0348f">5.8. Diminish</a></li>
<li><a href="#orgbab37bd">5.9. Dimmer</a></li>
</ul>
</li>
<li><a href="#orgaa6e981">6. Key Bindings</a></li>
<li><a href="#org0922b54">7. Org Mode</a>
<ul>
<li><a href="#orgee58dda">7.1. Font Faces</a></li>
<li><a href="#org6a19386">7.2. Basic Configuration</a></li>
<li><a href="#org75a199d">7.3. Org Mode Improvements</a>
<ul>
<li><a href="#org8b7d0db">7.3.1. Nicer Heading Bullets</a></li>
<li><a href="#org79f1d39">7.3.2. Center Org Buffers</a></li>
</ul>
</li>
<li><a href="#orgdec710a">7.4. Babel Languages</a></li>
<li><a href="#org2079510">7.5. Structure Templates</a></li>
<li><a href="#org1e92be0">7.6. Auto-tangle Configuration Files</a></li>
</ul>
</li>
<li><a href="#orged818c3">8. Writing Mode</a>
<ul>
<li><a href="#org45bcf88">8.1. Variable Pitch Mode</a></li>
<li><a href="#orgc267626">8.2. Darkroom Mode</a></li>
<li><a href="#org2384d87">8.3. Typography</a></li>
<li><a href="#org4f8e52d">8.4. Word counting</a></li>
<li><a href="#orgc87d866">8.5. Spell Checking</a></li>
</ul>
</li>
<li><a href="#orgd701fd4">9. Documentation Mode</a></li>
<li><a href="#org0f7d1c9">10. Development</a>
<ul>
<li><a href="#org47a1c96">10.1. Code editor</a>
<ul>
<li><a href="#org93d2bba">10.1.1. General Settings</a></li>
<li><a href="#orga1b252f">10.1.2. Fira Code Mode</a></li>
<li><a href="#org28e0bc6">10.1.3. Rainbow Delimiters</a></li>
<li><a href="#orge560969">10.1.4. Drag Stuff</a></li>
</ul>
</li>
<li><a href="#orga34fa25">10.2. Language Servers</a></li>
<li><a href="#org1be6c86">10.3. Code Completion</a></li>
<li><a href="#org6e6d7e2">10.4. Programming Languages</a>
<ul>
<li><a href="#orge126b3a">10.4.1. Haskell</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga1b6c5f">11. Internationalization</a>
<ul>
<li><a href="#orgc9913a3">11.1. Russian</a></li>
</ul>
</li>
<li><a href="#orga0040c1">12. Miscellaneous</a>
<ul>
<li><a href="#org32319c8">12.1. Custom Config File</a></li>
<li><a href="#org700eb3d">12.2. Miscellaneous Settings</a></li>
<li><a href="#org6ccc528">12.3. Recent Files</a></li>
<li><a href="#orgeda5a63">12.4. Sudo Edit</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgb4ea96f" class="outline-2">
<h2 id="orgb4ea96f"><span class="section-number-2">1</span> Global Variables</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #c792ea;">(</span><span style="color: #89DDFF;">defconst</span> <span style="color: #ffcb6b;">cfg/writing-modes</span> '<span style="color: #f78c6c;">(</span>org-mode text-mode<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">defconst</span> <span style="color: #ffcb6b;">cfg/default-font-size</span> 150<span style="color: #c792ea;">)</span>
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">defconst</span> <span style="color: #ffcb6b;">cfg/fill-column</span> 85<span style="color: #c792ea;">)</span>
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">defconst</span> <span style="color: #ffcb6b;">cfg/fill-dark-columnn</span> 60<span style="color: #c792ea;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5a4c5bc" class="outline-2">
<h2 id="org5a4c5bc"><span class="section-number-2">2</span> Package System Setup</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">require</span> '<span style="color: #f78c6c;">package</span><span style="color: #c792ea;">)</span>

<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">setq</span> package-archives
      '<span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"melpa-stable"</span> . <span style="color: #c3e88d;">"https://stable.melpa.org/packages/"</span><span style="color: #c3e88d;">)</span>
        <span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"melpa"</span> . <span style="color: #c3e88d;">"https://melpa.org/packages/"</span><span style="color: #c3e88d;">)</span>
        <span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"gnu"</span> . <span style="color: #c3e88d;">"https://elpa.gnu.org/packages/"</span><span style="color: #c3e88d;">)</span>
        <span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"org"</span> . <span style="color: #c3e88d;">"https://orgmode.org/elpa/"</span><span style="color: #c3e88d;">)</span><span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>

<span style="color: #c792ea;">(</span>package-initialize<span style="color: #c792ea;">)</span>
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">unless</span> package-archive-contents
  <span style="color: #f78c6c;">(</span>package-refresh-contents<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>

 <span style="color: #556369;">;; </span><span style="color: #556369;">Compatibility for non-Linux platforms</span>
 <span style="color: #556369;">;; </span><span style="color: #556369;">use-package is not installed by default</span>
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">unless</span> <span style="color: #f78c6c;">(</span>package-installed-p 'use-package<span style="color: #f78c6c;">)</span>
  <span style="color: #f78c6c;">(</span>package-install 'use-package<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>

<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">require</span> '<span style="color: #f78c6c;">use-package</span><span style="color: #c792ea;">)</span>
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">setq</span> use-package-always-ensure t<span style="color: #c792ea;">)</span>

 <span style="color: #556369;">;; </span><span style="color: #556369;">Fix $PATH environment variable for X sessions of Emacs</span>
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">exec-path-from-shell</span><span style="color: #c792ea;">)</span>
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">when</span> <span style="color: #f78c6c;">(</span>memq window-system '<span style="color: #c3e88d;">(</span>mac ns x<span style="color: #c3e88d;">)</span><span style="color: #f78c6c;">)</span>
  <span style="color: #f78c6c;">(</span>exec-path-from-shell-initialize<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>

 <span style="color: #556369;">;; </span><span style="color: #556369;">fixes some warnings</span>
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">gnu-elpa-keyring-update</span><span style="color: #c792ea;">)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org0a72ff2" class="outline-2">
<h2 id="org0a72ff2"><span class="section-number-2">3</span> Basic Configuration</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org1b94cb1" class="outline-3">
<h3 id="org1b94cb1"><span class="section-number-3">3.1</span> Disable Window Defaults</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">setq</span> inhibit-startup-message t<span style="color: #c792ea;">)</span>
<span style="color: #556369;">;; </span><span style="color: #556369;">disable default window elements</span>
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">when</span> <span style="color: #f78c6c;">(</span>window-system<span style="color: #f78c6c;">)</span>
  <span style="color: #f78c6c;">(</span>tool-bar-mode -1<span style="color: #f78c6c;">)</span>
  <span style="color: #f78c6c;">(</span>blink-cursor-mode -1<span style="color: #f78c6c;">)</span>
  <span style="color: #f78c6c;">(</span>tooltip-mode -1<span style="color: #f78c6c;">)</span>
  <span style="color: #f78c6c;">(</span>scroll-bar-mode -1<span style="color: #f78c6c;">)</span>
  <span style="color: #f78c6c;">(</span>menu-bar-mode -1<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>

</pre>
</div>
</div>
</div>
