Emacs.org
** Default Settings

Change default variables.

#+begin_src emacs-lisp

  (setq
    split-width-threshold 1              ; horizontal split only
    help-window-select t
    display-time-format "%H:%M"
    column-number-mode t		   ; display column n in modeline
    visible-bell t			   ; no beep
    ring-bell-function 'ignore
    fill-column cfg/fill-column
    kill-whole-line t	                   ; kill with line with \n
    indent-tabs-mode nil		   ; no tab characters allowed
    initial-scratch-message nil	   ; empty scratch
    sentence-end-double-space nil	   ; single space after coma
    ;; stop asking whether to save newly added abbrev when quitting emacs
    save-abbrevs 'silently
    ;; turn on abbrev mode globally
    abbrev-mode t
    completion-on-separator-character t) ; fill column width

    (show-paren-mode t)                  ; show matching parens
    (electric-pair-mode)                 ; parentheses autocomplete
    (delete-selection-mode t)            ; kill text on pasting
    (global-subword-mode 1)              ; Iterate through CamelCase words
    (display-time-mode 1)                ; show time in modeline
    (defalias 'yes-or-no-p 'y-or-n-p)    ; y / n prompt

#+end_src

#+begin_src emacs-lisp
  (if (eq system-type 'darwin)
   (setq mac-command-modifier 'control))
#+end_src


** Mouse Scrolling
#+begin_src emacs-lisp

  ;; scroll one line at a time (less "jumpy" than defaults)
  (setq mouse-wheel-scroll-amount '(2 ((shift) . 2)))
  (setq mouse-wheel-progressive-speed nil) ;; don't accelerate scrolling
  (setq mouse-wheel-follow-mouse 't)       ;; scroll window under mouse
  (setq scroll-step 2)                     ;; keyboard scroll one line at a time

#+end_src

** Save and Restore
Delete trailing white-space and add a final new line.
#+begin_src emacs-lisp

  (add-hook 'before-save-hook #'delete-trailing-whitespace)
  (setq require-final-newline t)

#+end_src

Save and restore Emacs status, including buffers, modes, point and windows.

#+begin_src emacs-lisp

  (use-package desktop
    :demand t
    :config
    (desktop-save-mode 0)
    (add-to-list 'desktop-globals-to-save 'golden-ratio-adjust-factor))

#+end_src

** Internationalization
*** Russian

Be careful with these settings on different systems. This code was originally written for Linux environment. For now I commented it out after switching to MacOS.

#+begin_src emacs-lisp

  ;;(set-language-environment 'UTF-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  ;;(setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING))
  ;; (prefer-coding-system 'utf-8-mac)
  ;;(setq default-input-method 'russian-computer)

#+end_src

** File Encryption

#+begin_src emacs-lisp
(require 'epa-file)

#+end_src

* Emacs Improvements
** Which Key

[[https://github.com/justbur/emacs-which-key][which-key]] is a useful UI panel that appears when you start pressing any key binding in Emacs to offer you all possible completions for the prefix.  For example, if you press =C-c= (hold control and press the letter =c=), a panel will appear at the bottom of the frame displaying all of the bindings under that prefix and which command they run.  This is very useful for learning the possible key bindings in the mode of your current buffer.

#+begin_src emacs-lisp

  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 1))

#+end_src

