Emacs.html

<div id="outline-container-org8daa91c" class="outline-3">
<h3 id="org8daa91c"><span class="section-number-3">3.2</span> Default Settings</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Change default variables.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">setq</span>
  split-width-threshold 1                   <span style="color: #556369;">; </span><span style="color: #556369;">horizontal split only</span>
  help-window-select t
  display-time-format <span style="color: #c3e88d;">"%H:%M"</span>
  column-number-mode t                  <span style="color: #556369;">; </span><span style="color: #556369;">display column n in modeline</span>
  visible-bell t                                <span style="color: #556369;">; </span><span style="color: #556369;">no beep</span>
  ring-bell-function 'ignore
  fill-column cfg/fill-column
  kill-whole-line t                             <span style="color: #556369;">; </span><span style="color: #556369;">kill with line with \n</span>
  indent-tabs-mode nil                  <span style="color: #556369;">; </span><span style="color: #556369;">no tab characters allowed</span>
  initial-scratch-message nil           <span style="color: #556369;">; </span><span style="color: #556369;">empty scratch</span>
  sentence-end-double-space nil         <span style="color: #556369;">; </span><span style="color: #556369;">single space after coma</span>
  completion-on-separator-character t   <span style="color: #556369;">; </span><span style="color: #556369;">fill column width</span>
<span style="color: #c792ea;">)</span>
<span style="color: #c792ea;">(</span>show-paren-mode t<span style="color: #c792ea;">)</span>       <span style="color: #556369;">; </span><span style="color: #556369;">show matching parens</span>
<span style="color: #c792ea;">(</span>electric-pair-mode<span style="color: #c792ea;">)</span>      <span style="color: #556369;">; </span><span style="color: #556369;">parentheses autocomplete</span>
<span style="color: #c792ea;">(</span>delete-selection-mode t<span style="color: #c792ea;">)</span> <span style="color: #556369;">; </span><span style="color: #556369;">kill text on pasting</span>
<span style="color: #c792ea;">(</span>global-subword-mode 1<span style="color: #c792ea;">)</span>   <span style="color: #556369;">; </span><span style="color: #556369;">Iterate through CamelCase words</span>
<span style="color: #c792ea;">(</span>display-time-mode 1<span style="color: #c792ea;">)</span>     <span style="color: #556369;">; </span><span style="color: #556369;">show time in modeline</span>
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">defalias</span> '<span style="color: #82aaff;">yes-or-no-p</span> 'y-or-n-p<span style="color: #c792ea;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org53070d6" class="outline-3">
<h3 id="org53070d6"><span class="section-number-3">3.3</span> Mouse Scrolling</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #556369;">;; </span><span style="color: #556369;">scroll one line at a time (less "jumpy" than defaults)</span>
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">setq</span> mouse-wheel-scroll-amount '<span style="color: #f78c6c;">(</span>2 <span style="color: #c3e88d;">(</span><span style="color: #89DDFF;">(</span>shift<span style="color: #89DDFF;">)</span> . 2<span style="color: #c3e88d;">)</span><span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">setq</span> mouse-wheel-progressive-speed nil<span style="color: #c792ea;">)</span> <span style="color: #556369;">;; </span><span style="color: #556369;">don't accelerate scrolling</span>
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">setq</span> mouse-wheel-follow-mouse 't<span style="color: #c792ea;">)</span>       <span style="color: #556369;">;; </span><span style="color: #556369;">scroll window under mouse</span>
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">setq</span> scroll-step 2<span style="color: #c792ea;">)</span>                     <span style="color: #556369;">;; </span><span style="color: #556369;">keyboard scroll one line at a time</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org2607a46" class="outline-3">
<h3 id="org2607a46"><span class="section-number-3">3.4</span> Save and Restore</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Delete trailing white-space and add a final new line.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #c792ea;">(</span>add-hook 'before-save-hook #'delete-trailing-whitespace<span style="color: #c792ea;">)</span>
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">setq</span> require-final-newline t<span style="color: #c792ea;">)</span>

</pre>
</div>

<p>
Save and restore Emacs status, including buffers, modes, point and windows.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">desktop</span>
  <span style="color: #82aaff;">:demand</span> t
  <span style="color: #82aaff;">:config</span>
  <span style="color: #f78c6c;">(</span>desktop-save-mode 1<span style="color: #f78c6c;">)</span>
  <span style="color: #f78c6c;">(</span>add-to-list 'desktop-globals-to-save 'golden-ratio-adjust-factor<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc4bc002" class="outline-2">
<h2 id="orgc4bc002"><span class="section-number-2">4</span> Global Packages</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgc87876d" class="outline-3">
<h3 id="orgc87876d"><span class="section-number-3">4.1</span> Which Key</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<a href="https://github.com/justbur/emacs-which-key">which-key</a> is a useful UI panel that appears when you start pressing any key binding in Emacs to offer you all possible completions for the prefix.  For example, if you press <code>C-c</code> (hold control and press the letter <code>c</code>), a panel will appear at the bottom of the frame displaying all of the bindings under that prefix and which command they run.  This is very useful for learning the possible key bindings in the mode of your current buffer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">which-key</span>
  <span style="color: #82aaff;">:init</span> <span style="color: #f78c6c;">(</span>which-key-mode<span style="color: #f78c6c;">)</span>
  <span style="color: #82aaff;">:diminish</span> which-key-mode
  <span style="color: #82aaff;">:config</span>
  <span style="color: #f78c6c;">(</span><span style="color: #89DDFF;">setq</span> which-key-idle-delay 1<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>

</pre>
</div>
</div>
</div>
