Emacs.org
** Ivy and Counsel

[[https://oremacs.com/swiper/][Ivy]] is an excellent completion framework for Emacs. It provides a minimal yet powerful selection menu that appears when you open files, switch buffers, and for many other tasks in Emacs. Counsel is a customized set of commands to replace `find-file` with `counsel-find-file`, etc which provide useful commands for each of the default completion commands. [[https://github.com/Yevgnen/ivy-rich][ivy-rich]] adds extra columns to a few of the Counsel commands to provide more information about each item.

#+begin_src emacs-lisp

  (use-package ivy
    :diminish
    :bind (("C-s" . swiper)
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done)
           ("C-l" . ivy-alt-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           :map ivy-switch-buffer-map
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-d" . ivy-switch-buffer-kill)
           :map ivy-reverse-i-search-map
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reverse-i-search-kill))
    :config
    (ivy-mode 1))

  (use-package ivy-rich
    :init
    :diminish
    :config
    (ivy-rich-mode 1))

  (use-package counsel
    :diminish
    :bind (("C-M-j" . 'counsel-switch-buffer)
           :map minibuffer-local-map
           ("C-r" . 'counsel-minibuffer-history))
    :config
    (counsel-mode 1))

#+end_src

Ivy/Counsel integration for =all-the-icons=.
#+begin_src emacs-lisp

  (use-package all-the-icons-ivy
    :init (add-hook 'after-init-hook 'all-the-icons-ivy-setup))

#+end_src

** Helpful Help Commands

[[https://github.com/Wilfred/helpful][Helpful]] adds a lot of very helpful (get it?) information to Emacs'
=describe-= command buffers. For example, if you use =describe-function=,
you will not only get the documentation about the function, you will
also see the source code of the function and where it gets used in
other places in the Emacs configuration. It is very useful for
figuring out how things work in Emacs.

#+begin_src emacs-lisp

  (use-package helpful
    :diminish
    :config
    (setq
      counsel-describe-function-function #'helpful-callable
      counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))

#+end_src

** Expand Region

Emacs extension to increase selected region by semantic units. With
the cursor at the c, it starts by marking the entire word abc, then
expand to the contents of the quotes abc def, then to the entire quote
"abc def", then to the contents of the sexp setq alphabet-start "abc
def" and finally to the entire sexp.

#+begin_src emacs-lisp

  (use-package expand-region
    :bind (("C-=" . er/expand-region)))

#+end_src

** Emojify

[[https://github.com/iqbalansari/emacs-emojify#emojify][Emojify]] is an Emacs extension to display emojis. It can display github
style emojis like :smile: or plain ASCII ones. It tries to be as
efficient as possible, while also providing a lot of flexibility

#+begin_src emacs-lisp

  (use-package emojify
    :diminish 'global-emojify-mode
    :bind ("C-c i e" . 'emojify-insert-emoji)
    :hook (after-init . global-emojify-mode))

#+end_src

* UI Configuration
** Built-ins
#+begin_src emacs-lisp

  (add-to-list 'default-frame-alist '(fullscreen . maximized)) ; fullsreen
  (fringe-mode '(10 . 10))

#+end_src

