Emacs.html

<div id="outline-container-orgbcf7d83" class="outline-3">
<h3 id="orgbcf7d83"><span class="section-number-3">4.2</span> Ivy and Counsel</h3>
<div class="outline-text-3" id="text-4-2">
<p>
<a href="https://oremacs.com/swiper/">Ivy</a> is an excellent completion framework for Emacs. It provides a
minimal yet powerful selection menu that appears when you open files,
switch buffers, and for many other tasks in Emacs. Counsel is a
customized set of commands to replace `find-file` with
`counsel-find-file`, etc which provide useful commands for each of the
default completion commands. <a href="https://github.com/Yevgnen/ivy-rich">ivy-rich</a> adds extra columns to a few of
the Counsel commands to provide more information about each item.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">ivy</span>
  <span style="color: #82aaff;">:diminish</span>
  <span style="color: #82aaff;">:bind</span> <span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"C-s"</span> . swiper<span style="color: #c3e88d;">)</span>
         <span style="color: #82aaff;">:map</span> ivy-minibuffer-map
         <span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"TAB"</span> . ivy-alt-done<span style="color: #c3e88d;">)</span>
         <span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"C-l"</span> . ivy-alt-done<span style="color: #c3e88d;">)</span>
         <span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"C-j"</span> . ivy-next-line<span style="color: #c3e88d;">)</span>
         <span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"C-k"</span> . ivy-previous-line<span style="color: #c3e88d;">)</span>
         <span style="color: #82aaff;">:map</span> ivy-switch-buffer-map
         <span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"C-k"</span> . ivy-previous-line<span style="color: #c3e88d;">)</span>
         <span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"C-l"</span> . ivy-done<span style="color: #c3e88d;">)</span>
         <span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"C-d"</span> . ivy-switch-buffer-kill<span style="color: #c3e88d;">)</span>
         <span style="color: #82aaff;">:map</span> ivy-reverse-i-search-map
         <span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"C-k"</span> . ivy-previous-line<span style="color: #c3e88d;">)</span>
         <span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"C-d"</span> . ivy-reverse-i-search-kill<span style="color: #c3e88d;">)</span><span style="color: #f78c6c;">)</span>
  <span style="color: #82aaff;">:config</span>
  <span style="color: #f78c6c;">(</span>ivy-mode 1<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>

<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">ivy-rich</span>
  <span style="color: #82aaff;">:init</span>
  <span style="color: #82aaff;">:diminish</span>
  <span style="color: #82aaff;">:config</span>
  <span style="color: #f78c6c;">(</span>ivy-rich-mode 1<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>

<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">counsel</span>
  <span style="color: #82aaff;">:diminish</span>
  <span style="color: #82aaff;">:bind</span> <span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"C-M-j"</span> . 'counsel-switch-buffer<span style="color: #c3e88d;">)</span>
         <span style="color: #82aaff;">:map</span> minibuffer-local-map
         <span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"C-r"</span> . 'counsel-minibuffer-history<span style="color: #c3e88d;">)</span><span style="color: #f78c6c;">)</span>
  <span style="color: #82aaff;">:config</span>
  <span style="color: #f78c6c;">(</span>counsel-mode 1<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>

</pre>
</div>

<p>
Ivy/Counsel integration for <code>all-the-icons</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">all-the-icons-ivy</span>
  <span style="color: #82aaff;">:init</span> <span style="color: #f78c6c;">(</span>add-hook 'after-init-hook 'all-the-icons-ivy-setup<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org0a41193" class="outline-3">
<h3 id="org0a41193"><span class="section-number-3">4.3</span> Helpful Help Commands</h3>
<div class="outline-text-3" id="text-4-3">
<p>
<a href="https://github.com/Wilfred/helpful">Helpful</a> adds a lot of very helpful (get it?) information to Emacs'
<code>describe-</code> command buffers. For example, if you use <code>describe-function</code>,
you will not only get the documentation about the function, you will
also see the source code of the function and where it gets used in
other places in the Emacs configuration. It is very useful for
figuring out how things work in Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">helpful</span>
  <span style="color: #82aaff;">:diminish</span>
  <span style="color: #82aaff;">:config</span>
  <span style="color: #f78c6c;">(</span><span style="color: #89DDFF;">setq</span>
    counsel-describe-function-function #'helpful-callable
    counsel-describe-variable-function #'helpful-variable<span style="color: #f78c6c;">)</span>
  <span style="color: #82aaff;">:bind</span>
  <span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">[</span>remap describe-function<span style="color: #c3e88d;">]</span> . counsel-describe-function<span style="color: #f78c6c;">)</span>
  <span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">[</span>remap describe-command<span style="color: #c3e88d;">]</span> . helpful-command<span style="color: #f78c6c;">)</span>
  <span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">[</span>remap describe-variable<span style="color: #c3e88d;">]</span> . counsel-describe-variable<span style="color: #f78c6c;">)</span>
  <span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">[</span>remap describe-key<span style="color: #c3e88d;">]</span> . helpful-key<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org48fc338" class="outline-3">
<h3 id="org48fc338"><span class="section-number-3">4.4</span> Expand Region</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Emacs extension to increase selected region by semantic units. With
the cursor at the c, it starts by marking the entire word abc, then
expand to the contents of the quotes abc def, then to the entire quote
"abc def", then to the contents of the sexp setq alphabet-start "abc
def" and finally to the entire sexp.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">expand-region</span>
  <span style="color: #82aaff;">:bind</span> <span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"C-="</span> . er/expand-region<span style="color: #c3e88d;">)</span><span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org1877ca9" class="outline-3">
<h3 id="org1877ca9"><span class="section-number-3">4.5</span> Emojify</h3>
<div class="outline-text-3" id="text-4-5">
<p>
<a href="https://github.com/iqbalansari/emacs-emojify#emojify">Emojify</a> is an Emacs extension to display emojis. It can display github
style emojis like :smile: or plain ASCII ones. It tries to be as
efficient as possible, while also providing a lot of flexibility
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">emojify</span>
  <span style="color: #82aaff;">:diminish</span> 'global-emojify-mode
  <span style="color: #82aaff;">:bind</span> <span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">"C-c i e"</span> . 'emojify-insert-emoji<span style="color: #f78c6c;">)</span>
  <span style="color: #82aaff;">:hook</span> <span style="color: #f78c6c;">(</span>after-init . global-emojify-mode<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org729ebeb" class="outline-2">
<h2 id="org729ebeb"><span class="section-number-2">5</span> UI Configuration</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgd9f0e46" class="outline-3">
<h3 id="orgd9f0e46"><span class="section-number-3">5.1</span> Built-ins</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #c792ea;">(</span>add-to-list 'default-frame-alist '<span style="color: #f78c6c;">(</span>fullscreen . maximized<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span> <span style="color: #556369;">; </span><span style="color: #556369;">fullsreen</span>
<span style="color: #c792ea;">(</span>fringe-mode '<span style="color: #f78c6c;">(</span>10 . 10<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>

</pre>
</div>
</div>
</div>
