Emacs.org
** All The Icons

Several packages depend on this

#+begin_src emacs-lisp

  (use-package all-the-icons)

  (use-package all-the-icons-dired
    :diminish
    :config
    :hook
      (dired-mode . (lambda ()
        (interactive)
        (unless (file-remote-p default-directory)
          (all-the-icons-dired-mode)))))

  (use-package dired-subtree
    :config
    (advice-add 'dired-subtree-toggle
      :after
        (lambda ()
          (interactive)
          (when all-the-icons-dired-mode
            (revert-buffer)))))

#+end_src

** Font Face
#+begin_src emacs-lisp

  (set-face-attribute 'default nil
  :font "Fira Code"
  :height cfg/default-font-size)

  ;; Set the fixed pitch face
  (set-face-attribute 'fixed-pitch nil
  :font "Fira Code"
  :height cfg/default-font-size)

  ;; Set the variable pitch face
  (set-face-attribute 'variable-pitch nil
  :font "Avenir"
  :height cfg/default-font-size
  :weight 'regular)

#+end_src

** Color Theme

#+begin_src emacs-lisp

  (use-package doom-themes
    :config
    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
          doom-themes-enable-italic t       ; if nil, italics is universally disabled
          doom-themes-treemacs-theme "doom-colors")
    (doom-themes-visual-bell-config)   ; Enable flashing mode-line on errors
    (doom-themes-neotree-config)       ; Enable custom neotree theme
    (doom-themes-treemacs-config))
    :init
    (load-theme 'doom-one t)

#+end_src

** Dashboard

[[https://github.com/emacs-dashboard/emacs-dashboard][Emacs Dashboard]]
An extensible emacs startup screen showing you what’s most important.

#+begin_src emacs-lisp

  (use-package dashboard
    :config
    (dashboard-setup-startup-hook))
  (setq
    dashboard-startup-banner 'logo
    dashboard-center-content t
    dashboard-show-shortcuts nil
    dashboard-set-heading-icons t
    dashboard-set-file-icons t)

#+end_src

** Centaur Tabs

[[https://github.com/ema2159/centaur-tabs][Centaur-Tabs]]  aims to become an aesthetic, functional and efficient tabs plugin for Emacs with a lot of customization options.

#+begin_src emacs-lisp

    (use-package centaur-tabs
      :demand
      :config
      (setq
        centaur-tabs-mode t
        centaur-tabs-gray-out-icons 'buffer
        centaur-tabs-style "rounded"
        centaur-tabs-height 36
        centaur-tabs-set-icons t
        centaur-tabs-set-modified-marker t
        centaur-tabs-modified-marker "●"
        ;; centaur-tabs-buffer-groups-function
          ;; #'centaur-tabs-projectile-buffer-groups
          )
      :bind
      (("s-[" . #'centaur-tabs-backward)
       ("s-]" . #'centaur-tabs-forward)))
    (centaur-tabs-mode)

#+end_src

** Doom Modeline

[[https://github.com/seagle0128/doom-modeline][doom-modeline]] is a very attractive and rich (yet still minimal) mode line configuration for Emacs.  The default configuration is quite good but you can check out the [[https://github.com/seagle0128/doom-modeline#customize][configuration options]] for more things you can enable or disable.

*NOTE:* The first time you load your configuration on a new machine, you'll need to run
 =M-x all-the-icons-install-fonts=
so that mode line icons display correctly.

#+begin_src emacs-lisp

  (use-package doom-modeline
    :init (doom-modeline-mode 1)
    :config (setq
              doom-modeline-minor-modes t
              doom-modeline-height 15))

#+end_src

