Emacs.html

<div id="outline-container-orgefb6d2b" class="outline-3">
<h3 id="orgefb6d2b"><span class="section-number-3">5.2</span> All The Icons</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Several packages depend on this
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">all-the-icons</span><span style="color: #c792ea;">)</span>

<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">all-the-icons-dired</span>
  <span style="color: #82aaff;">:diminish</span>
  <span style="color: #82aaff;">:config</span>
  <span style="color: #82aaff;">:hook</span> <span style="color: #f78c6c;">(</span>dired-mode . <span style="color: #c3e88d;">(</span><span style="color: #89DDFF;">lambda</span> <span style="color: #89DDFF;">()</span>
                       <span style="color: #89DDFF;">(</span><span style="color: #89DDFF;">interactive</span><span style="color: #89DDFF;">)</span>
                       <span style="color: #89DDFF;">(</span><span style="color: #89DDFF;">unless</span> <span style="color: #bb80b3;">(</span>file-remote-p default-directory<span style="color: #bb80b3;">)</span>
                         <span style="color: #bb80b3;">(</span>all-the-icons-dired-mode<span style="color: #bb80b3;">)</span><span style="color: #89DDFF;">)</span><span style="color: #c3e88d;">)</span><span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>


<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">dired-subtree</span>
  <span style="color: #82aaff;">:config</span>
  <span style="color: #f78c6c;">(</span>advice-add 'dired-subtree-toggle <span style="color: #82aaff;">:after</span> <span style="color: #c3e88d;">(</span><span style="color: #89DDFF;">lambda</span> <span style="color: #89DDFF;">()</span>
                                             <span style="color: #89DDFF;">(</span><span style="color: #89DDFF;">interactive</span><span style="color: #89DDFF;">)</span>
                                             <span style="color: #89DDFF;">(</span><span style="color: #89DDFF;">when</span> all-the-icons-dired-mode
                                               <span style="color: #bb80b3;">(</span>revert-buffer<span style="color: #bb80b3;">)</span><span style="color: #89DDFF;">)</span><span style="color: #c3e88d;">)</span><span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-orgf8d4ff1" class="outline-3">
<h3 id="orgf8d4ff1"><span class="section-number-3">5.3</span> Font Face</h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #c792ea;">(</span>set-face-attribute 'default nil
<span style="color: #82aaff;">:font</span> <span style="color: #c3e88d;">"Fira Code Retina"</span>
<span style="color: #82aaff;">:height</span> cfg/default-font-size<span style="color: #c792ea;">)</span>

<span style="color: #556369;">;; </span><span style="color: #556369;">Set the fixed pitch face</span>
<span style="color: #c792ea;">(</span>set-face-attribute 'fixed-pitch nil
<span style="color: #82aaff;">:font</span> <span style="color: #c3e88d;">"Fira Code Retina"</span>
<span style="color: #82aaff;">:height</span> cfg/default-font-size<span style="color: #c792ea;">)</span>

<span style="color: #556369;">;; </span><span style="color: #556369;">Set the variable pitch face</span>
<span style="color: #c792ea;">(</span>set-face-attribute 'variable-pitch nil
<span style="color: #82aaff;">:font</span> <span style="color: #c3e88d;">"DejaVu Serif"</span>
<span style="color: #82aaff;">:height</span> cfg/default-font-size
<span style="color: #82aaff;">:weight</span> 'regular<span style="color: #c792ea;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga40c5f3" class="outline-3">
<h3 id="orga40c5f3"><span class="section-number-3">5.4</span> Color Theme</h3>
<div class="outline-text-3" id="text-5-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">doom-themes</span>
  <span style="color: #82aaff;">:config</span>
  <span style="color: #556369;">;; </span><span style="color: #556369;">Global settings (defaults)</span>
  <span style="color: #f78c6c;">(</span><span style="color: #89DDFF;">setq</span> doom-themes-enable-bold t    <span style="color: #556369;">; </span><span style="color: #556369;">if nil, bold is universally disabled</span>
        doom-themes-enable-italic t<span style="color: #f78c6c;">)</span> <span style="color: #556369;">; </span><span style="color: #556369;">if nil, italics is universally disabled</span>
  <span style="color: #f78c6c;">(</span>doom-themes-visual-bell-config<span style="color: #f78c6c;">)</span>   <span style="color: #556369;">; </span><span style="color: #556369;">Enable flashing mode-line on errors</span>
  <span style="color: #f78c6c;">(</span>doom-themes-neotree-config<span style="color: #f78c6c;">)</span>       <span style="color: #556369;">; </span><span style="color: #556369;">Enable custom neotree theme (all-the-icons)</span>
  <span style="color: #f78c6c;">(</span><span style="color: #89DDFF;">setq</span> doom-themes-treemacs-theme <span style="color: #c3e88d;">"doom-colors"</span><span style="color: #f78c6c;">)</span> <span style="color: #556369;">; </span><span style="color: #556369;">use the colorful treemacs theme</span>
  <span style="color: #f78c6c;">(</span>doom-themes-treemacs-config<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>
  <span style="color: #82aaff;">:init</span>
  <span style="color: #c792ea;">(</span>load-theme 'doom-material t<span style="color: #c792ea;">)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org9e47a40" class="outline-3">
<h3 id="org9e47a40"><span class="section-number-3">5.5</span> Dashboard</h3>
<div class="outline-text-3" id="text-5-5">
<p>
<a href="https://github.com/emacs-dashboard/emacs-dashboard">Emacs Dashboard</a>
An extensible emacs startup screen showing you what’s most important.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">dashboard</span>
  <span style="color: #82aaff;">:config</span>
  <span style="color: #f78c6c;">(</span>dashboard-setup-startup-hook<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">setq</span>
  dashboard-startup-banner 'logo
  dashboard-center-content t
  dashboard-show-shortcuts nil
  dashboard-set-heading-icons t
  dashboard-set-file-icons t<span style="color: #c792ea;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5fb44d4" class="outline-3">
<h3 id="org5fb44d4"><span class="section-number-3">5.6</span> Centaur Tabs</h3>
<div class="outline-text-3" id="text-5-6">
<p>
<a href="https://github.com/ema2159/centaur-tabs">Centaur-Tabs</a>  aims to become an aesthetic, functional and efficient tabs plugin for Emacs with a lot of customization options.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">centaur-tabs</span>
  <span style="color: #82aaff;">:demand</span>
  <span style="color: #82aaff;">:config</span>
  <span style="color: #f78c6c;">(</span><span style="color: #89DDFF;">setq</span>
    centaur-tabs-mode t
    centaur-tabs-gray-out-icons 'buffer
    centaur-tabs-style <span style="color: #c3e88d;">"rounded"</span>
    centaur-tabs-height 36
    centaur-tabs-set-icons t
    centaur-tabs-set-modified-marker t
    centaur-tabs-modified-marker <span style="color: #c3e88d;">"&#9679;"</span>
    centaur-tabs-buffer-groups-function
      #'centaur-tabs-projectile-buffer-groups<span style="color: #f78c6c;">)</span>

  <span style="color: #82aaff;">:bind</span>
  <span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"s-["</span> . #'centaur-tabs-backward<span style="color: #c3e88d;">)</span>
   <span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"s-]"</span> . #'centaur-tabs-forward<span style="color: #c3e88d;">)</span><span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>
<span style="color: #c792ea;">(</span>centaur-tabs-mode<span style="color: #c792ea;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf7a87fe" class="outline-3">
<h3 id="orgf7a87fe"><span class="section-number-3">5.7</span> Doom Modeline</h3>
<div class="outline-text-3" id="text-5-7">
<p>
<a href="https://github.com/seagle0128/doom-modeline">doom-modeline</a> is a very attractive and rich (yet still minimal) mode line configuration for Emacs.  The default configuration is quite good but you can check out the <a href="https://github.com/seagle0128/doom-modeline#customize">configuration options</a> for more things you can enable or disable.
</p>

<p>
<b>NOTE:</b> The first time you load your configuration on a new machine, you'll need to run
 <code>M-x all-the-icons-install-fonts</code>
so that mode line icons display correctly.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">doom-modeline</span>
  <span style="color: #82aaff;">:init</span> <span style="color: #f78c6c;">(</span>doom-modeline-mode 1<span style="color: #f78c6c;">)</span>
  <span style="color: #82aaff;">:config</span> <span style="color: #f78c6c;">(</span><span style="color: #89DDFF;">setq</span>
            doom-modeline-minor-modes t
            doom-modeline-height 15<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>

</pre>
</div>
</div>
</div>
