Emacs.html

<div id="outline-container-org9e0348f" class="outline-3">
<h3 id="org9e0348f"><span class="section-number-3">5.8</span> Diminish</h3>
<div class="outline-text-3" id="text-5-8">
<p>
The <a href="https://github.com/emacsmirror/diminish">diminish</a> package implements hiding or abbreviation of the mode line displays
(lighters) of minor-modes.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"> <span style="color: #556369;">;; </span><span style="color: #556369;">diminish built-in minor modes</span>
 <span style="color: #556369;">;; </span><span style="color: #556369;">diminish for installed packages is done in each package config</span>
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">diminish</span>
  <span style="color: #82aaff;">:diminish</span> visual-line-mode
  <span style="color: #82aaff;">:diminish</span> org-indent-mode
  <span style="color: #82aaff;">:diminish</span> abbrev-mode
  <span style="color: #82aaff;">:diminish</span> subword-mode
  <span style="color: #82aaff;">:diminish</span> ispell-mode
  <span style="color: #82aaff;">:diminish</span> buffer-face-mode
  <span style="color: #82aaff;">:diminish</span> outline-minor-mode
  <span style="color: #82aaff;">:diminish</span> auto-fill-function<span style="color: #c792ea;">)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-orgbab37bd" class="outline-3">
<h3 id="orgbab37bd"><span class="section-number-3">5.9</span> Dimmer</h3>
<div class="outline-text-3" id="text-5-9">
<p>
A slightly more apparent indicator of which buffer is active at the moment.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">dimmer</span>
  <span style="color: #82aaff;">:config</span>
    <span style="color: #f78c6c;">(</span><span style="color: #89DDFF;">setq</span> dimmer-fraction 0.1<span style="color: #f78c6c;">)</span>
    <span style="color: #f78c6c;">(</span>dimmer-mode<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>

</pre>
</div>
</div>
</div>
</div>
