Emacs.org
** Basic Configuration

This section contains the basic configuration for =org-mode= plus the configuration for Org agendas and capture templates.

#+begin_src emacs-lisp

  (defun cfg/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (visual-line-mode 1)
    (diminish 'org-indent-mode)
    (setq
     org-hide-emphasis-markers t
     org-fontify-emphasized-text t
     org-src-fontify-natively t))


  (use-package org
    :hook (org-mode . cfg/org-mode-setup)
    :config
    (setq
      org-ellipsis " ▾"
      org-agenda-start-with-log-mode t
      org-log-done 'time
      org-log-into-drawer t)
    (cfg/org-font-setup))

#+end_src

** Org Mode Improvements
*** Nicer Heading Bullets

[[https://github.com/sabof/org-bullets][org-bullets]] replaces the heading stars in =org-mode= buffers with nicer looking characters that you can control.  Another option for this is [[https://github.com/integral-dw/org-superstar-mode][org-superstar-mode]] which we may cover in a later video.

#+begin_src emacs-lisp

  (use-package org-bullets
    :after org
    :hook (org-mode . org-bullets-mode)
    :config
      (setq org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

#+end_src

*** Center Org Buffers

We use [[https://github.com/joostkremers/visual-fill-column][visual-fill-column]] to center =org-mode= buffers for a more pleasing writing experience as it centers the contents of the buffer horizontally to seem more like you are editing a document. This is really a matter of personal preference so you can remove the block below if you don't like the behavior.

#+begin_src emacs-lisp

  (defun cfg/visual-fill ()
    (setq visual-fill-column-width  nil
      visual-fill-column-center-text t)
    (visual-fill-column-mode 1))
  (use-package visual-fill-column
    :hook (text-mode . cfg/visual-fill))

  ;;  interactive adjustments to the text size (e.g., with
  ;;  text-size-adjust) cannot be detected by visual-fill-column-mode,
  ;;  therefore if you adjust the text size while
  ;;  visual-fill-column-mode is active
  (advice-add 'text-scale-adjust :after #'visual-fill-column-adjust)

#+end_src

** Babel Languages
To execute or export code in =org-mode= code blocks, you'll need to set up =org-babel-load-languages= for each language you'd like to use.
[[https://orgmode.org/worg/org-contrib/babel/languages.html] This page]]: documents all of the languages that you can use with
=org-babel=.

#+begin_src emacs-lisp

  (org-babel-do-load-languages 'org-babel-load-languages
    '((emacs-lisp . t)
      (python . t)))

  (push '("conf-unix" . conf-unix) org-src-lang-modes)

#+end_src

** Structure Templates
#+begin_src emacs-lisp

  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (setq org-confirm-babel-evaluate nil)

#+end_src

** Auto-tangle Configuration Files

This snippet adds a hook to =org-mode= buffers so that =cfg/org-babel-tangle-config= gets executed each time such a buffer gets saved.  This function checks to see if the file being saved is the Emacs.org file you're looking at right now, and if so, automatically exports the configuration here to the associated output files.

#+begin_src emacs-lisp

  ;; Automatically tangle our Emacs.org config file when we save it
  (defun cfg/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "~/.emacs.d/Emacs.org"))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'cfg/org-babel-tangle-config)))

#+end_src

* Text Modes
** Variable Pitch Mode

Use =variable-pitch-mode= and =flyspell-mode=.
In addition =cfg/visual-fill= function is used to center text.

#+begin_src emacs-lisp

  (defun cfg/text-mode-setup ()
    (variable-pitch-mode 1)
    (flyspell-mode)
    (cfg/visual-fill))
  (add-hook 'text-mode-hook 'cfg/text-mode-setup)

#+end_src

