Emacs.html

<div id="outline-container-org6a19386" class="outline-3">
<h3 id="org6a19386"><span class="section-number-3">7.2</span> Basic Configuration</h3>
<div class="outline-text-3" id="text-7-2">
<p>
This section contains the basic configuration for <code>org-mode</code> plus the configuration for Org agendas and capture templates.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">defun</span> <span style="color: #82aaff;">cfg/org-mode-setup</span> <span style="color: #f78c6c;">()</span>
  <span style="color: #f78c6c;">(</span>org-indent-mode<span style="color: #f78c6c;">)</span>
  <span style="color: #f78c6c;">(</span>variable-pitch-mode 1<span style="color: #f78c6c;">)</span>
  <span style="color: #f78c6c;">(</span>visual-line-mode 1<span style="color: #f78c6c;">)</span>
  <span style="color: #f78c6c;">(</span>diminish 'org-indent-mode<span style="color: #f78c6c;">)</span>
  <span style="color: #f78c6c;">(</span><span style="color: #89DDFF;">setq</span>
   org-hide-emphasis-markers t
   org-fontify-emphasized-text t
   org-src-fontify-natively t<span style="color: #f78c6c;">)</span>
<span style="color: #c792ea;">)</span>

<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">org</span>
  <span style="color: #82aaff;">:hook</span> <span style="color: #f78c6c;">(</span>org-mode . cfg/org-mode-setup<span style="color: #f78c6c;">)</span>
  <span style="color: #82aaff;">:config</span>
  <span style="color: #f78c6c;">(</span><span style="color: #89DDFF;">setq</span>
    org-ellipsis <span style="color: #c3e88d;">" &#9662;"</span>
    org-agenda-start-with-log-mode t
    org-log-done 'time
    org-log-into-drawer t<span style="color: #f78c6c;">)</span>
  <span style="color: #f78c6c;">(</span>cfg/org-font-setup<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>
<span style="color: #556369;">;; </span><span style="color: #556369;">#'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org75a199d" class="outline-3">
<h3 id="org75a199d"><span class="section-number-3">7.3</span> Org Mode Improvements</h3>
<div class="outline-text-3" id="text-7-3">
</div>
<div id="outline-container-org8b7d0db" class="outline-4">
<h4 id="org8b7d0db"><span class="section-number-4">7.3.1</span> Nicer Heading Bullets</h4>
<div class="outline-text-4" id="text-7-3-1">
<p>
<a href="https://github.com/sabof/org-bullets">org-bullets</a> replaces the heading stars in <code>org-mode</code> buffers with nicer looking characters that you can control.  Another option for this is <a href="https://github.com/integral-dw/org-superstar-mode">org-superstar-mode</a> which we may cover in a later video.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">org-bullets</span>
  <span style="color: #82aaff;">:after</span> org
  <span style="color: #82aaff;">:hook</span> <span style="color: #f78c6c;">(</span>org-mode . org-bullets-mode<span style="color: #f78c6c;">)</span>
  <span style="color: #82aaff;">:config</span>
    <span style="color: #f78c6c;">(</span><span style="color: #89DDFF;">setq</span> org-bullets-bullet-list '<span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"&#9673;"</span> <span style="color: #c3e88d;">"&#9675;"</span> <span style="color: #c3e88d;">"&#9679;"</span> <span style="color: #c3e88d;">"&#9675;"</span> <span style="color: #c3e88d;">"&#9679;"</span> <span style="color: #c3e88d;">"&#9675;"</span> <span style="color: #c3e88d;">"&#9679;"</span><span style="color: #c3e88d;">)</span><span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org79f1d39" class="outline-4">
<h4 id="org79f1d39"><span class="section-number-4">7.3.2</span> Center Org Buffers</h4>
<div class="outline-text-4" id="text-7-3-2">
<p>
We use <a href="https://github.com/joostkremers/visual-fill-column">visual-fill-column</a> to center <code>org-mode</code> buffers for a more pleasing writing experience as it centers the contents of the buffer horizontally to seem more like you are editing a document.  This is really a matter of personal preference so you can remove the block below if you don't like the behavior.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">defun</span> <span style="color: #82aaff;">cfg/visual-fill</span> <span style="color: #f78c6c;">()</span>
  <span style="color: #f78c6c;">(</span><span style="color: #89DDFF;">setq</span> visual-fill-column-width cfg/fill-column
    visual-fill-column-center-text t<span style="color: #f78c6c;">)</span>
  <span style="color: #f78c6c;">(</span>visual-fill-column-mode 1<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">visual-fill-column</span>
  <span style="color: #82aaff;">:hook</span> <span style="color: #f78c6c;">(</span>org-mode . cfg/visual-fill<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdec710a" class="outline-3">
<h3 id="orgdec710a"><span class="section-number-3">7.4</span> Babel Languages</h3>
<div class="outline-text-3" id="text-7-4">
<p>
To execute or export code in <code>org-mode</code> code blocks, you'll need to
set up <code>org-babel-load-languages</code> for each language you'd like to use.
<a href="https://orgmode.org/worg/org-contrib/babel/languages.html">This page</a> documents all of the languages that you can use with
<code>org-babel</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #c792ea;">(</span>org-babel-do-load-languages
  'org-babel-load-languages
  '<span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">(</span>emacs-lisp . t<span style="color: #c3e88d;">)</span>
    <span style="color: #c3e88d;">(</span>python . t<span style="color: #c3e88d;">)</span><span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>

<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">push</span> '<span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">"conf-unix"</span> . conf-unix<span style="color: #f78c6c;">)</span> org-src-lang-modes<span style="color: #c792ea;">)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org2079510" class="outline-3">
<h3 id="org2079510"><span class="section-number-3">7.5</span> Structure Templates</h3>
<div class="outline-text-3" id="text-7-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">require</span> '<span style="color: #f78c6c;">org-tempo</span><span style="color: #c792ea;">)</span>
<span style="color: #c792ea;">(</span>add-to-list 'org-structure-template-alist '<span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">"sh"</span> . <span style="color: #c3e88d;">"src shell"</span><span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>
<span style="color: #c792ea;">(</span>add-to-list 'org-structure-template-alist '<span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">"el"</span> . <span style="color: #c3e88d;">"src emacs-lisp"</span><span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>
<span style="color: #c792ea;">(</span>add-to-list 'org-structure-template-alist '<span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">"py"</span> . <span style="color: #c3e88d;">"src python"</span><span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">setq</span> org-confirm-babel-evaluate nil<span style="color: #c792ea;">)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org1e92be0" class="outline-3">
<h3 id="org1e92be0"><span class="section-number-3">7.6</span> Auto-tangle Configuration Files</h3>
<div class="outline-text-3" id="text-7-6">
<p>
This snippet adds a hook to <code>org-mode</code> buffers so that <code>cfg/org-babel-tangle-config</code> gets executed each time such a buffer gets saved.  This function checks to see if the file being saved is the Emacs.org file you're looking at right now, and if so, automatically exports the configuration here to the associated output files.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #556369;">;; </span><span style="color: #556369;">Automatically tangle our Emacs.org config file when we save it</span>
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">defun</span> <span style="color: #82aaff;">cfg/org-babel-tangle-config</span> <span style="color: #f78c6c;">()</span>
  <span style="color: #f78c6c;">(</span><span style="color: #89DDFF;">when</span> <span style="color: #c3e88d;">(</span>string-equal <span style="color: #89DDFF;">(</span>buffer-file-name<span style="color: #89DDFF;">)</span>
                      <span style="color: #89DDFF;">(</span>expand-file-name <span style="color: #c3e88d;">"~/.emacs.d/Emacs.org"</span><span style="color: #89DDFF;">)</span><span style="color: #c3e88d;">)</span>
    <span style="color: #556369;">;; </span><span style="color: #556369;">Dynamic scoping to the rescue</span>
    <span style="color: #c3e88d;">(</span><span style="color: #89DDFF;">let</span> <span style="color: #89DDFF;">(</span><span style="color: #bb80b3;">(</span>org-confirm-babel-evaluate nil<span style="color: #bb80b3;">)</span><span style="color: #89DDFF;">)</span>
      <span style="color: #89DDFF;">(</span>org-babel-tangle<span style="color: #89DDFF;">)</span><span style="color: #c3e88d;">)</span><span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>

<span style="color: #c792ea;">(</span>add-hook 'org-mode-hook <span style="color: #f78c6c;">(</span><span style="color: #89DDFF;">lambda</span> <span style="color: #c3e88d;">()</span> <span style="color: #c3e88d;">(</span>add-hook 'after-save-hook #'cfg/org-babel-tangle-config<span style="color: #c3e88d;">)</span><span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orged818c3" class="outline-2">
<h2 id="orged818c3"><span class="section-number-2">8</span> Writing Mode</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org45bcf88" class="outline-3">
<h3 id="org45bcf88"><span class="section-number-3">8.1</span> Variable Pitch Mode</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Use <code>variable-pitch-mode</code> and <code>flyspell-mode</code>.
In addition <code>cfg/visual-fill</code> function is used to center text.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #c792ea;">(</span><span style="color: #89DDFF;">defun</span> <span style="color: #82aaff;">cfg/text-mode-setup</span> <span style="color: #f78c6c;">()</span>
  <span style="color: #f78c6c;">(</span>variable-pitch-mode 1<span style="color: #f78c6c;">)</span>
  <span style="color: #f78c6c;">(</span>flyspell-mode<span style="color: #f78c6c;">)</span>
  <span style="color: #f78c6c;">(</span>cfg/visual-fill<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>
<span style="color: #c792ea;">(</span>add-hook 'text-mode-hook 'cfg/text-mode-setup<span style="color: #c792ea;">)</span>
</pre>
</div>
</div>
</div>
