Emacs.org
*** Rainbow Delimiters

[[https://github.com/Fanael/rainbow-delimiters][rainbow-delimiters]] is a "rainbow parentheses"-like mode which highlights delimiters such as parentheses, brackets or braces according to their depth. Each successive level is highlighted in a different color. This makes it easy to spot matching delimiters, orient yourself in the code, and tell which statements are at a given depth.

#+begin_src emacs-lisp

  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))

#+end_src

*** Drag Stuff
[[https://github.com/rejeep/drag-stuff.el][Drag Stuff]] is a minor mode for Emacs that makes it possible to drag stuff (words, region, lines) around in Emacs.

#+begin_src emacs-lisp

  (use-package drag-stuff
    :diminish
    :hook (prog-mode . drag-stuff-mode)
    :config
      (drag-stuff-define-keys))

#+end_src

** Language Servers

#+begin_src emacs-lisp

    (defun cfg/lsp-mode-setup ()
      (setq lsp-headerline-breadcrumb-segments
       '(path-up-to-project file symbols))
      (lsp-headerline-breadcrumb-mode))

    (use-package lsp-mode
      :commands (lsp lsp-deferred)
      :hook (lsp-mode . cfg/lsp-mode-setup)
      :init
      (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
      :config
      (lsp-enable-which-key-integration t)
      (define-key lsp-mode-map (kbd "C-c C-h") 'lsp-describe-thing-at-point))

    (use-package lsp-ui
      :hook (lsp-mode . lsp-ui-mode))
    (setq
        lsp-ui-sideline-enable nil
        lsp-ui-doc-mode nil
        lsp-ui-doc-show-with-cursor nil
        lsp-ui-doc-show-with-mouse nil
        lsp-lens-enable t
        lsp-ui-doc-position 'top)

     (setq lsp-enable-file-watchers nil)

      (defun markdown-raw-links (&rest ignore)
        "Convert link markup [ANCHOR](URL) to raw URL
         so lsp-ui-doc--make-clickable-link can find it"
        (save-excursion
          (goto-char (point-min))
          (while (re-search-forward markdown-regex-link-inline nil t)
              (replace-match (replace-regexp-in-string "\n" "" (match-string 6))))))
      (advice-add 'lsp--render-markdown :before #'markdown-raw-links)


     ;; hack to prevent dimmer from interacting with lsp ui frames
    ;(setq lsp-ui-doc-use-childframe nil)

    (use-package lsp-treemacs
      :after lsp)

    (use-package lsp-ivy
      :after (ivy lsp-mode))

#+end_src

** Code Completion

#+begin_src emacs-lisp

  (use-package company
    :hook
      ((lsp-mode prog-mode elisp-mode) . company-mode)
    :diminish (company-mode "[CC]")
    :bind (:map company-active-map
           ("<tab>" . company-complete-selection))
          (:map lsp-mode-map
           ("<tab>" . company-indent-or-complete-common))
    :config
    (setq
      company-minimum-prefix-length 1
      company-tooltip-align-annotations t
      company-tooltip-flip-when-above t
      company-show-numbers t
      company-idle-delay 0.2))

  ;(use-package company-box
   ;:hook (company-mode . company-box-mode))

#+end_src

** Programming Languages
