Emacs.html

<div id="outline-container-org28e0bc6" class="outline-4">
<h4 id="org28e0bc6"><span class="section-number-4">10.1.3</span> Rainbow Delimiters</h4>
<div class="outline-text-4" id="text-10-1-3">
<p>
<a href="https://github.com/Fanael/rainbow-delimiters">rainbow-delimiters</a> is a "rainbow parentheses"-like mode which highlights delimiters such as parentheses, brackets or braces according to their depth. Each successive level is highlighted in a different color. This makes it easy to spot matching delimiters, orient yourself in the code, and tell which statements are at a given depth.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">rainbow-delimiters</span>
  <span style="color: #82aaff;">:hook</span> <span style="color: #f78c6c;">(</span>prog-mode . rainbow-delimiters-mode<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-orge560969" class="outline-4">
<h4 id="orge560969"><span class="section-number-4">10.1.4</span> Drag Stuff</h4>
<div class="outline-text-4" id="text-10-1-4">
<p>
<a href="https://github.com/rejeep/drag-stuff.el">Drag Stuff</a> is a minor mode for Emacs that makes it possible to drag stuff (words, region, lines) around in Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">drag-stuff</span>
  <span style="color: #82aaff;">:diminish</span>
  <span style="color: #82aaff;">:hook</span> <span style="color: #f78c6c;">(</span>prog-mode . drag-stuff-mode<span style="color: #f78c6c;">)</span>
  <span style="color: #82aaff;">:config</span>
    <span style="color: #f78c6c;">(</span>drag-stuff-define-keys<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga34fa25" class="outline-3">
<h3 id="orga34fa25"><span class="section-number-3">10.2</span> Language Servers</h3>
<div class="outline-text-3" id="text-10-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">defun</span> <span style="color: #82aaff;">cfg/lsp-mode-setup</span> <span style="color: #f78c6c;">()</span>
  <span style="color: #f78c6c;">(</span><span style="color: #89DDFF;">setq</span> lsp-headerline-breadcrumb-segments '<span style="color: #c3e88d;">(</span>path-up-to-project file symbols<span style="color: #c3e88d;">)</span><span style="color: #f78c6c;">)</span>
  <span style="color: #f78c6c;">(</span>lsp-headerline-breadcrumb-mode<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>

<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">lsp-mode</span>
  <span style="color: #82aaff;">:commands</span> <span style="color: #f78c6c;">(</span>lsp lsp-deferred<span style="color: #f78c6c;">)</span>
  <span style="color: #82aaff;">:hook</span> <span style="color: #f78c6c;">(</span>lsp-mode . cfg/lsp-mode-setup<span style="color: #f78c6c;">)</span>
  <span style="color: #82aaff;">:init</span>
  <span style="color: #f78c6c;">(</span><span style="color: #89DDFF;">setq</span> lsp-keymap-prefix <span style="color: #c3e88d;">"C-c l"</span><span style="color: #f78c6c;">)</span>  <span style="color: #556369;">;; </span><span style="color: #556369;">Or 'C-l', 's-l'</span>
  <span style="color: #82aaff;">:config</span>
  <span style="color: #f78c6c;">(</span>lsp-enable-which-key-integration t<span style="color: #f78c6c;">)</span>
  <span style="color: #f78c6c;">(</span>define-key lsp-mode-map <span style="color: #c3e88d;">(</span>kbd <span style="color: #c3e88d;">"C-c C-h"</span><span style="color: #c3e88d;">)</span> 'lsp-describe-thing-at-point<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>

<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">lsp-ui</span>
  <span style="color: #82aaff;">:hook</span> <span style="color: #f78c6c;">(</span>lsp-mode . lsp-ui-mode<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">setq</span>
    lsp-ui-sideline-enable nil
    lsp-ui-doc-mode nil
    lsp-ui-doc-show-with-cursor nil
    lsp-ui-doc-show-with-mouse nil
    lsp-lens-enable t
    lsp-ui-doc-position 'top<span style="color: #c792ea;">)</span>


  <span style="color: #c792ea;">(</span><span style="color: #89DDFF;">defun</span> <span style="color: #82aaff;">markdown-raw-links</span> <span style="color: #f78c6c;">(</span><span style="color: #c792ea;">&amp;rest</span> ignore<span style="color: #f78c6c;">)</span>
    <span style="color: #556369;">"Convert link markup [ANCHOR](URL) to raw URL</span>
<span style="color: #556369;">     so lsp-ui-doc--make-clickable-link can find it"</span>
    <span style="color: #f78c6c;">(</span><span style="color: #89DDFF;">save-excursion</span>
      <span style="color: #c3e88d;">(</span>goto-char <span style="color: #89DDFF;">(</span>point-min<span style="color: #89DDFF;">)</span><span style="color: #c3e88d;">)</span>
      <span style="color: #c3e88d;">(</span><span style="color: #89DDFF;">while</span> <span style="color: #89DDFF;">(</span>re-search-forward markdown-regex-link-inline nil t<span style="color: #89DDFF;">)</span>
          <span style="color: #89DDFF;">(</span>replace-match <span style="color: #bb80b3;">(</span>replace-regexp-in-string <span style="color: #c3e88d;">"\n"</span> <span style="color: #c3e88d;">""</span> <span style="color: #ffcb6b;">(</span>match-string 6<span style="color: #ffcb6b;">)</span><span style="color: #bb80b3;">)</span><span style="color: #89DDFF;">)</span><span style="color: #c3e88d;">)</span><span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>
  <span style="color: #c792ea;">(</span>advice-add 'lsp--render-markdown <span style="color: #82aaff;">:before</span> #'markdown-raw-links<span style="color: #c792ea;">)</span>


 <span style="color: #556369;">;; </span><span style="color: #556369;">hack to prevent dimmer from interacting with lsp ui frames</span>
<span style="color: #556369;">;</span><span style="color: #556369;">(setq lsp-ui-doc-use-childframe nil)</span>

<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">lsp-treemacs</span>
  <span style="color: #82aaff;">:after</span> lsp<span style="color: #c792ea;">)</span>

<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">lsp-ivy</span>
  <span style="color: #82aaff;">:after</span> <span style="color: #f78c6c;">(</span>ivy lsp-mode<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org1be6c86" class="outline-3">
<h3 id="org1be6c86"><span class="section-number-3">10.3</span> Code Completion</h3>
<div class="outline-text-3" id="text-10-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #c792ea;">(</span><span style="color: #89DDFF;">use-package</span> <span style="color: #f78c6c;">company</span>
  <span style="color: #82aaff;">:hook</span>
    <span style="color: #f78c6c;">(</span><span style="color: #c3e88d;">(</span>lsp-mode prog-mode elisp-mode<span style="color: #c3e88d;">)</span> . company-mode<span style="color: #f78c6c;">)</span>
  <span style="color: #82aaff;">:diminish</span> <span style="color: #f78c6c;">(</span>company-mode <span style="color: #c3e88d;">"[CC]"</span><span style="color: #f78c6c;">)</span>
  <span style="color: #82aaff;">:bind</span> <span style="color: #f78c6c;">(</span><span style="color: #82aaff;">:map</span> company-active-map
         <span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"&lt;tab&gt;"</span> . company-complete-selection<span style="color: #c3e88d;">)</span><span style="color: #f78c6c;">)</span>
        <span style="color: #f78c6c;">(</span><span style="color: #82aaff;">:map</span> lsp-mode-map
         <span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"&lt;tab&gt;"</span> . company-indent-or-complete-common<span style="color: #c3e88d;">)</span><span style="color: #f78c6c;">)</span>
  <span style="color: #82aaff;">:config</span>
  <span style="color: #f78c6c;">(</span><span style="color: #89DDFF;">setq</span>
    company-minimum-prefix-length 1
    company-tooltip-align-annotations t
    company-tooltip-flip-when-above t
    company-show-numbers t
    company-idle-delay 0.2<span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span>

<span style="color: #556369;">;</span><span style="color: #556369;">(use-package company-box</span>
<span style="color: #556369;">;  </span><span style="color: #556369;">:hook (company-mode . company-box-mode))</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org6e6d7e2" class="outline-3">
<h3 id="org6e6d7e2"><span class="section-number-3">10.4</span> Programming Languages</h3>
<div class="outline-text-3" id="text-10-4">
</div>
